{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "FGenAIChineseModelsEditorModule",
			"Children": [
				{
					"Source":
					{
						"Text": "Configuration for the Chinese Models GenAI plugin"
					},
					"Translation":
					{
						"Text": "Configuration for the Chinese Models GenAI plugin"
					},
					"Key": "GenAIChineseModelsDescription"
				},
				{
					"Source":
					{
						"Text": "GenAI Chinese Models"
					},
					"Translation":
					{
						"Text": "GenAI Chinese Models"
					},
					"Key": "GenAIChineseModelsSettingsName"
				}
			]
		},
		{
			"Namespace": "K2Node_MakeChineseModelsSettings",
			"Children": [
				{
					"Source":
					{
						"Text": "A full {0} settings structure with a model dropdown."
					},
					"Translation":
					{
						"Text": "A full {0} settings structure with a model dropdown."
					},
					"Key": "NodeTooltip"
				},
				{
					"Source":
					{
						"Text": "Creates settings for an AI service (INVALID)"
					},
					"Translation":
					{
						"Text": "Creates settings for an AI service (INVALID)"
					},
					"Key": "InvalidNodeTooltip"
				},
				{
					"Source":
					{
						"Text": "Make AI Settings (INVALID)"
					},
					"Translation":
					{
						"Text": "Make AI Settings (INVALID)"
					},
					"Key": "InvalidNodeTitle"
				},
				{
					"Source":
					{
						"Text": "Make {0}"
					},
					"Translation":
					{
						"Text": "Make {0}"
					},
					"Key": "NodeTitle"
				}
			]
		},
		{
			"Namespace": "SGraphNodeMakeGenAIChineseSettings",
			"Children": [
				{
					"Source":
					{
						"Text": "Model"
					},
					"Translation":
					{
						"Text": "Model"
					},
					"Key": "ModelLabel"
				},
				{
					"Source":
					{
						"Text": "Select a Model..."
					},
					"Translation":
					{
						"Text": "Select a Model..."
					},
					"Key": "NoModelSelected"
				},
				{
					"Source":
					{
						"Text": "Set Model"
					},
					"Translation":
					{
						"Text": "Set Model"
					},
					"Key": "SetModel"
				}
			]
		}
	]
}